Revit 2027 API
Toposolid.CanBeExcavatedBy Method
 Checks if the given element can be used to excavate the Toposolid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeExcavatedBy(
	ElementId elementId
)
Public Function CanBeExcavatedBy (
	elementId As ElementId
) As Boolean
public:
bool CanBeExcavatedBy(
	ElementId^ elementId
)
member CanBeExcavatedBy :
        elementId : ElementId -> bool
Parameters
elementId ElementId
 Id of the element
Return Value
Boolean
 True if the element can be used to excavate the Toposolid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace